package com.beiming.uhf_test.data

/**
 * created by zhangshi on 2022/8/18.
 */
object ConstData {

    val BOX_KIND = arrayOf("单相", "三相")

    val DAN_BIAO_WEI = arrayOf("未选择",
        "2表位",
        "3表位",
        "4表位单排1",
        "4表位单排2",
        "4表位单2排",
        "6表位2排",
        "8表位2排",
        "10表位2排",
        "6表位3排",
        "9表位3排",
        "12表位3排",
        "15表位3排")

    val DAN_CHI_CUN = mapOf(
        "2表位" to "648×450×150",
        "3表位" to "790×450×150",
        "4表位单排1" to "1026×450×150",
        "4表位单排2" to "1026×450×150",
        "4表位单2排" to "728×800×180",
        "6表位2排" to "870×800×180",
        "8表位2排" to "1106×800×180",
        "10表位2排" to "1248×800×180",
        "6表位3排" to "758×1000×180",
        "9表位3排" to "910×1000×180,890×1000×180",
        "12表位3排" to "1166×1000×180,1146×1000×180",
        "15表位3排" to "1318×1000×180,1288×1000×180")

    val SAN_CHI_CUN = mapOf(
        "2表位单排" to "860×550×150",
        "3表位单排" to "1160×550×150",
        "2表位2排" to "780×1000×180",
        "4表位2排" to "890×1000×180",
        "6表位2排" to "1220×1000×180",
        "1表位" to "700×1000×180",
        "2表位" to "1000×1000×180",
        "互感器接入式1表位" to "700×1000×180",
        "互感器接入式2表位" to "910×1000×180"
    )


    val SAN_BIAO_WEI = arrayOf("未选择",
        "2表位单排",
        "3表位单排",
        "2表位2排",
        "4表位2排",
        "6表位2排",
        "1表位",
        "2表位",
        "互感器接入式1表位",
        "互感器接入式2表位"
        )


}